{
  "backend/main.mo": "Motoko backend actor providing user profiles, role checks, job postings, candidate/employer profiles, and application storage with access control.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend brand‑token, component‑system, and visual‑theme features with associated files and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of major frontend files, components, hooks, and pages for reference.",
  "frontend/index.css": "Tailwind base file defining CSS variable tokens, light/dark theme values, and applying global background, text, and border styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app routing setup with TanStack Router, shared layout, marketing pages, jobs pages, and dashboard routes.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal collecting user name, email, and role, then saving the profile via backend query with validation and toast feedback.",
  "frontend/src/components/auth/RequireAppRole.tsx": "Guards children by checking user profile role and displays loading, missing profile, or access denied states.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated and has a profile before rendering children, otherwise shows login or setup prompts.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with navigation links, branding, and attribution.",
  "frontend/src/components/layout/StickyNavbar.tsx": "Provides a sticky responsive navbar with navigation links, authentication handling, and a mobile menu.",
  "frontend/src/components/states/EmptyState.tsx": "Displays an empty-state message with an icon, description, and optional action button.",
  "frontend/src/components/states/InlineAlert.tsx": "Shows an inline alert with variant-based styling and optional title.",
  "frontend/src/components/states/LoadingSkeleton.tsx": "Provides skeleton components for job cards, job details, and application cards during loading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, candidate, employer, and job data via an actor API.",
  "frontend/src/index.css": "Defines global Tailwind styles, brand color tokens, typography rules, and light/dark theme variables.",
  "frontend/src/lib/errors.ts": "Normalizes backend errors into readable user-facing messages with special handling for auth and validation cases.",
  "frontend/src/lib/seo.ts": "Implements a hook to update document title and meta/OG tags for SEO.",
  "frontend/src/lib/utils.ts": "Contains helper functions for class merging and formatting salaries and dates.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/dashboard/AdminPage.tsx": "Renders the admin dashboard page with SEO setup and role-based access control.",
  "frontend/src/pages/dashboard/candidate/CandidateApplicationsPage.tsx": "Shows a candidate's job applications with status, job lookup, loading states, and error handling.",
  "frontend/src/pages/dashboard/candidate/CandidateDashboardPage.tsx": "Provides candidate dashboard links to manage profile and view applications with SEO and role protection.",
  "frontend/src/pages/dashboard/candidate/CandidateProfilePage.tsx": "Form page for candidates to view and update their profile fields using query hooks and mutation.",
  "frontend/src/pages/dashboard/DashboardIndexPage.tsx": "Redirects authenticated users to their role-specific dashboard.",
  "frontend/src/pages/dashboard/employer/EmployerApplicationsPage.tsx": "Displays applications for a selected job, with filters, loading states, and status update actions.",
  "frontend/src/pages/dashboard/employer/EmployerCompanyPage.tsx": "Form for employers to view and update their company profile information.",
  "frontend/src/pages/dashboard/employer/EmployerDashboardPage.tsx": "Employer dashboard showing navigation cards to company profile, jobs, and applications.",
  "frontend/src/pages/dashboard/employer/EmployerJobEditPage.tsx": "Loads an existing job and provides a form to edit and update job details.",
  "frontend/src/pages/dashboard/employer/EmployerJobNewPage.tsx": "Form for creating a new job posting, including slug generation and submission.",
  "frontend/src/pages/dashboard/employer/EmployerJobsPage.tsx": "Employer dashboard page listing the user's jobs with edit/delete actions and loading/empty states.",
  "frontend/src/pages/dashboard/SettingsPage.tsx": "Displays a protected settings page placeholder with SEO setup.",
  "frontend/src/pages/jobs/JobDetailPage.tsx": "Displays detailed job information and handles application flow with auth, role checks, and error states.",
  "frontend/src/pages/jobs/JobsListPage.tsx": "Public job browsing page with search filters, loading/empty states, and a grid of job cards.",
  "frontend/src/pages/marketing/AboutPage.tsx": "Static marketing page describing the platform’s mission, UK focus, and values.",
  "frontend/src/pages/marketing/CandidatesPage.tsx": "Marketing page for candidates outlining the job‑search process and linking to job listings.",
  "frontend/src/pages/marketing/ContactPage.tsx": "Contact page showing email options, support info, and office hours.",
  "frontend/src/pages/marketing/EmployersPage.tsx": "Marketing page for employers with hero, step-by-step hiring process, and job posting CTAs.",
  "frontend/src/pages/marketing/FaqPage.tsx": "Displays a list of FAQs using an accordion component with SEO metadata.",
  "frontend/src/pages/marketing/HomePage.tsx": "Homepage showcasing hero section, CTAs for candidates and employers, UK map placeholder, and value props.",
  "frontend/src/pages/marketing/SuccessStoriesPage.tsx": "Shows testimonials from users with ratings and SEO metadata.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom theming, colors, typography, animations, and container settings.",
  "project_state.json": "Defines the current architectural plan, features, and requirements for building the HOSPO TALENT platform, including frontend, backend, auth, data model, and UI directives. Serves as a central project blueprint with no active issues."
}